////[~문제1~]
//1. 13
//2. 30
//3. 3
//4. 1
//
////[~문제2~]
//1. 60
//2. 27
//3. 3
//
////[~문제3~]
//답: 4
//
////[~문제4~]
//답: 2
//
////[~문제5~]
//답: 1 & 4
//
////[~문제6~]
//답: 2 & 4
//
////[~문제8~]
//답: () ++ % >> & && ?: +=//중요!!!!
//
////[~문제9~]
//답:
//  2.00 +  3.00 =  9.00 //
//  2.00 -  3.00 = -5.00 //
//  2.00 *  3.00 = 24.00 //
//
////[~문제10~]
//답: 
//int main()
//{
//	int money;
//	int remain;
//	printf("## 지폐로 교환일 돈은? ");
//	scanf("%d", &money);
//
//	printf("\n오만 원짜리 ==> %d 장\n", money / 50000);
//	printf("만 원짜리 ==> %d 장\n", money % 50000 / 10000);
//	printf("오천 원짜리 ==> %d 장\n", money % 10000 / 5000);
//	printf("천 원짜리 ==> %d 장\n", money % 5000 / 1000);
//	printf("지폐로 바꾸지 못한 잔돈 ==> %d 원\n", money % 1000);
//
//	return 0;
//}
//
////[~문제11~]
//답:
//101
//101
//101

////[~문제12~]
//답:
//int main()
//{
//	int a;
//
//	printf("값을 입력하세요. : ");
//	scanf("%d", &a);
//
//	if (a == 100)
//		printf("100입니다.\n");
//	else
//		printf("100이 아닙니다.\n");
//	return 0;
//}
